#Embedded file name: C:/Users/user/Documents/WORK/roB/build/tmp/tw2/res/entities\client\data/flowback_activity_data.o
data = {1: {'desc': 'Откровение Возврат Вознаграждение <br/> В течение всего времени, когда тебя не было, мы надеялись, что ты вернешься. Мы подготовили для вас награду Revelation Returnee. Он содержит: дополнительные предметы для попытки экспертного рейда, брелоки генерала и многое другое. Наслаждайтесь!',
     'fun3': ('\xd0\x9f\xd0\xbe\xd0\xbb\xd1\x83\xd1\x87\xd0\xb8\xd1\x82\xd1\x8c \xd0\xbf\xd0\xbe\xd0\xb4\xd0\xb0\xd1\x80\xd0\xbe\xd0\xba \xd0\xb7\xd0\xb0 \xd0\xb2\xd0\xbe\xd0\xb7\xd0\xb2\xd1\x80\xd0\xb0\xd1\x89\xd0\xb5\xd0\xbd\xd0\xb8\xd0\xb5', 0),
     'name': 'Подарок за возвращение'},
 2: {'desc': 'С возвращением!<br> У вас накопилось много концентрата, который можно использовать для ускоренного получения опыта. <br> Дополнительный опыт также можно получить в купальнях и охотничьих угодьях.<br> Не упустите возможность быстро наверстать упущенное, стремительно нагнав соратников и давнишних соперников!',
     'fun1': ('\xd0\x9f\xd0\xbe\xd0\xbb\xd1\x83\xd1\x87\xd0\xb8\xd1\x82\xd1\x8c \xd0\xbe\xd0\xbf\xd1\x8b\xd1\x82', 110155673),
     'name': 'Наверстать упущенный опыт'},
 3: {'desc': 'Время меняет многое, но неизменны верные союзники, сражающиеся с вами бок о бок. <br/>Вернувшиеся игроки могут получить подарки от друзей и участников гильдии! В награду те получат таэли или вклад в дело гильдии. <br/>Призы гильдии можно забирать на данной панели каждый день. Не пропустите!',
     'fun3': ('\xd0\x9f\xd0\xbe\xd0\xbb\xd1\x83\xd1\x87\xd0\xb8\xd1\x82\xd1\x8c \xd0\xbf\xd0\xbe\xd0\xb4\xd0\xb0\xd1\x80\xd0\xbe\xd0\xba \xd0\xbe\xd1\x82 \xd0\xb3\xd0\xb8\xd0\xbb\xd1\x8c\xd0\xb4\xd0\xb8\xd0\xb8', 1),
     'name': 'Объятия друга'},
 4: {'desc': 'Возвращение квеста <br/> Игроки с баффом «Все в одной лодке» могут пойти со своими товарищами по команде к Эдварду Крылатому Дракону, чтобы получить квесты «Все в одной лодке». Заполните их, чтобы получить дополнительные пробные награды!',
     'fun1': ('\xd0\x9f\xd1\x80\xd0\xb5\xd1\x82\xd0\xb5\xd0\xbd\xd0\xb7\xd0\xb8\xd1\x8f \xd0\xbd\xd0\xb0\xd0\xbf\xd1\x80\xd1\x8f\xd0\xbc\xd1\x83\xd1\x8e', 110155561),
     'fun2': ('\xd0\xbd\xd0\xb0\xd0\xb9\xd1\x82\xd0\xb8 \xd1\x82\xd0\xbe\xd0\xb2\xd0\xb0\xd1\x80\xd0\xb8\xd1\x89\xd0\xb5\xd0\xb9 \xd0\xbf\xd0\xbe \xd0\xba\xd0\xbe\xd0\xbc\xd0\xb0\xd0\xbd\xd0\xb4\xd0\xb5', 210153),
     'name': 'Организатор тотализатора'},
 5: {'desc': 'Возвращение квеста <br/> Игроки с баффом «Товарищи по оружию» могут пойти со своими товарищами по команде к Эдварду Драконьему Крылу, чтобы получить задания «Товарищи по оружию». Заполните их, чтобы получить дополнительные экспертные награды!',
     'fun1': ('\xd0\x9f\xd1\x80\xd0\xb5\xd1\x82\xd0\xb5\xd0\xbd\xd0\xb7\xd0\xb8\xd1\x8f \xd0\xbd\xd0\xb0\xd0\xbf\xd1\x80\xd1\x8f\xd0\xbc\xd1\x83\xd1\x8e', 110155561),
     'fun2': ('\xd0\xbd\xd0\xb0\xd0\xb9\xd1\x82\xd0\xb8 \xd1\x82\xd0\xbe\xd0\xb2\xd0\xb0\xd1\x80\xd0\xb8\xd1\x89\xd0\xb5\xd0\xb9 \xd0\xbf\xd0\xbe \xd0\xba\xd0\xbe\xd0\xbc\xd0\xb0\xd0\xbd\xd0\xb4\xd0\xb5', 210154),
     'name': 'Товарищи по оружию'}}
from utils import convertToConst
data = convertToConst(data, name='_'.join(__name__.split('.')), ktype='int', vtype='dict')
