#Embedded file name: C:/Users/user/Documents/WORK/roB/build/tmp/tw2/res/entities\client\data/hobby_presale_rule_data.o
data = {1: {'desc': 'Коробка Ausgyth Brocade была разделена на <font color=’#FFFF00’>три партии</font> для игроков, чтобы купить.'},
 2: {'desc': "Персонаж должен быть как минимум <font color=’#FFFF00’>30 уровня,</font> чтобы сделать заказ. Каждая учетная запись может зарезервировать и активировать одну из следующих функций: Deluxe edition, Luxury edition и Collector\' edition."},
 3: {'desc': '<html> После оформления бронирования необходимо внести временный депозит ('},
 4: {'desc': 'Депозит будет <font color=’#FFFF00’>возвращен только персонажу, который сделал заказ,</font> а не другим персонажам.'},
 5: {'desc': 'После бронирования игрок получит код бронирования, не привязанный к его аккаунту. Используйте код бронирования для оплаты в указанном магазине периферийных устройств. Код можно использовать только для покупки зарезервированного товара.'},
 6: {'desc': 'После получения кода бронирования необходимо произвести оплату в магазине периферийных устройств до истечения срока действия. Код бронирования с истекшим сроком действия больше не будет действительным. Никакие замены не будут предоставлены для просроченных кодов.'},
 7: {'desc': 'Первые 60 игроков, совершивших покупку, получат одну копию Антологии концептуального искусства Revelation Online I. Список победителей см. В официальных объявлениях.'},
 8: {'desc': '<font color=’#FFFF00’>За каждый раунд бронирования будет выпущено только ограниченное количество коробок с парчой Ausgyth</font> . Если все оговорки были сделаны, то раунд будет закрыт. Игрокам, которые не смогли сделать бронирование, придется ждать следующего раунда.'},
 9: {'desc': 'КЛАВИША CD для виртуальных предметов Ausgyth Brocade Box не привязана к учетной записи игрока. Храните ваш CD-KEY в безопасности и не допускайте его утечки другим игрокам. Срок действия CD-KEY <font color=’#FFFF00’>истекает 31 декабря 2018 года</font> .'},
 10: {'desc': 'Предметы, предоставляемые активацией CD-KEY, не связаны, <font color=’#FFFF00’>но могут быть проданы только через кросс-серверный аукционный дом</font> .'}}
from utils import convertToConst
data = convertToConst(data, name='_'.join(__name__.split('.')), ktype='int', vtype='dict')
