#Embedded file name: C:/Users/user/Documents/WORK/roB/build/tmp/tw2/res/entities\client\data/marriage_plan_data.o
data = {1: {'desc': 'Вы можете выбрать любой понравившийся стиль свадьбы, каждый из которых содержит <font color=\"#ff7f00\">уникальные свадебные наряды, караваны, оформления Церемониальной палаты</font>. <br/> Для бронирования свадьбы у лидера группы должно быть от 288 до 1314 рубиновых сердец. При подтверждении бронирования предметы расходуются. Обратите внимание, свадьбу <font color=\"#ff7f00\">можно проводить неоднократно</font>!',
     'iconPath': '10101',
     'moivePath': 'marry',
     'showItems': (369981, 369982, 369977, 369978, 369979, 369976, 369975)},
 2: {'desc': 'Игроки со всех серверов могут участвовать в межсерверной церемонии. Для бронирования свадьбы у лидера группы должно быть 520 кристальных частиц и 1314 рубиновых сердец. При подтверждении бронирования предметы расходуются. Обратите внимание, свадьбу <font color=\"#ff7f00\">можно проводить неоднократно</font>!',
     'iconPath': '60012',
     'moivePath': 'marry2',
     'showItems': (220142, 369982, 369977, 334588, 334587, 369976, 369975)}}
from utils import convertToConst
data = convertToConst(data, name='_'.join(__name__.split('.')), ktype='int', vtype='dict')
